porcinePulmonaryArteriesFSI/system/ctrlDcts/controlDict.eighth
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs            ("libwindkesselPressure.so");

application     solids4Foam;

startFrom       startTime;

startTime       2.8;

stopAt          endTime;

endTime         3.35;

deltaT          1e-3;

writeControl    runTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;
fileHandler     uncollated;

functions
{
    displacement
    {
        type            solidPointDisplacement;
        region          solid;
        point           (0 0.005 0.025);
    }
    solidForce
    {
        type           solidForces;
        historyPatch   inner-wall;
    }
    forces
    {
        type                forces;
        libs                ( "libforces.so" );
        writeControl        timeStep;
        writeInterval       1;
        patches             (wall);
        "pName|p"           p;
        "UName|U"           U;
        "rhoName|rho"       rhoInf;
        log                 false;
        rhoInf              1000;
        CofR                (0.5 0.1 0);
        region              fluid;
    }
    fsiConvData
    {
        type fsiConvergenceData;
        region fluid;
    }

}

DebugSwitches
{
    elasticWallPressure  1;
}

DebugSwitches
{
    elasticWallPressure  1;
}

// ************************************************************************* //
