porcinePulmonaryArteriesFSI/constant/fluid/dynamicMeshDict

/*--------------------------------*- C++ -*----------------------------------* \
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh           dynamicMotionSolverFvMesh;

"solver|motionSolver"   velocityLaplacian;
//diffusivity             inverseVolume 1(wall);
diffusivity             quadratic inverseDistance 1(wall);

// ************************************************************************* //
