porcinePulmonaryArteriesFSI/constant/fluid/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      flowProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//nu              nu [0 2 -1 0 0 0 0] 3.5e-6;
rho             rho [1 -3 0 0 0 0 0] 1060;

// The dynamic viscosity is used only for sonicLiquidFluid
mu              mu [1 -1 -1 0 0 0 0] 3e-3;

// For piso/transientSimple
//transportModel  Newtonian;
transportModel  BirdCarreau;//Newtonian;

BirdCarreauCoeffs
{
  nu0   0.000151;
  nuInf 3.3e-6; 
  k     8.2;  
  n     0.2128;
  a     0.64;
}


// ************************************************************************* //
