porcinePulmonaryArteriesFSI/constant/fsiProperties
fsiProperties.pimpleFluid