porcinePulmonaryArteriesFSI/0/fluid.pimpleFluid/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  //    #includeEtc "caseDicts/setConstraintTypes"

  processor
    {
      type processor;
    }

  
    inlet
    {
        type            calculated;
        value           $internalField;
    }

    wall
    {
        type            zeroGradient;
        //value           $internalField;
    }
    
    "auto.*"
    {
        type            calculated;
        value           $internalField;
    }

}


// ************************************************************************* //
