porcinePulmonaryArteriesFSI/0/fluid.pimpleFluid/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.6;

boundaryField
{
processor
  {
    type processor;
  }

  inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    wall
    {
        type            zeroGradient;
    }

    "auto.*"
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }


}



// ************************************************************************* //
