porcinePulmonaryArteriesFSI/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default            Euler;
    //default            backward;
}
    wallDist
    {
        method  meshWave;
    }


gradSchemes
{
  default            Gauss linear;//leastSquares;
}

divSchemes
{
    default            none;
    div(phi,U)         Gauss linearUpwind grad(U);//Gauss linearUpwind cellLimited leastSquares 1;
    div(phid,p)        Gauss linearUpwind cellLimited leastSquares 1;

    turbulence        bounded Gauss upwind;
       div(phi,kl)      $turbulence;
     div(phi,omega) $turbulence;
    div(phi,kt) $turbulence;

    div((nuEff*dev2(T(grad(U)))))   Gauss linear;
    div((nuEff*dev(T(grad(U)))))    Gauss linear;
}

laplacianSchemes
{
    default            Gauss linear corrected;
}

interpolationSchemes
{
    default            linear;
}

snGradSchemes
{
    default            corrected;
}

fluxRequired
{
    default            no;
    p;
}

// ************************************************************************* //
