porcinePulmonaryArteriesFSI/system/inletP

type surfaceFieldValue;
region fluid;
libs (fieldFunctionObjects);

enabled true;

writeFields false;
log true;
regionType patch;
name inlet;
operation areaAverage;
fields (p);
